TABLE_FINDER_DICT = {'Анализ инфекций': ['иммуноферментные исследования инфекций'],
                     'Анализ мочи общий': ['анализ мочи общий'],
                     'Биохимия Covid19': ['биохимия covid19'],
                     'Биохимия крови': ['анализ крови биохимический'],
                     'Выявление антител к ВИЧ': ['выявления антител к вич'],
                     'Гликемический профиль': ['гликемический профиль'],
                     'Глюкоза в венозной крови': ['глюкоза в венозной крови'],
                     'Интерлейкин': ['интерлейкин'],
                     'Коагулограмма': ['ориентировочное исследование системы гемостаза'],
                     'Коагулограмма Covid19': ['коагулограмма covid19'],
                     'МР с КЛА': ['мр с кла'],
                     'ОАК Covid19': ['оак covid19'],
                     'Общий анализ крови развернутый': ['общий (клинический) анализ крови развернутый',
                                                        'анализ крови развернутый'],
                     'Общий анализ мокроты': ['общий анализ мокроты'],
                     'Общий (клинический) анализ мочи': ['общий (клинический) анализ мочи',
                                           'анализ мочи'],
                     'ПЦР': ['определение рнк коронавируса торс'],
                     'Уровень тропонинов': ['исследование уровня тропонинов'],
                     'Уровень ферритина': ['исследование уровня ферритина'],
                     }




COLUMN_TABLE = {'Коагулограмма Covid19': ['date', 'PV', 'MNO', 'D_dimer'],
                'Общий анализ мочи': ['date', 'glykoza', 'belok', 'pH', 'ud_ves',
                                      'leikocits', 'blood', 'nitrits',
                                      'ketons', 'urobilinogen', 'bilirubin',
                                      'askorbin', 'color', 'transparency'],
                'ОАК Covid19': ['date', 'WBC', 'RBC', 'MCV', 'HCT', 'HGB', 'MCH',
                                'MCHC', 'PLT', 'MPV', 'PCT', 'PDW', 'RDW', 'RDWa',
                                'NEU_perc', 'LYM_perc', 'MON_perc', 'NEU', 'LYM',
                                'MON', 'SOE', 'glykoza', 'laktat', 'EOS_perc',
                                'BAS_perc', 'EOS', 'BAS', 'segmento_perc', 'eozino_perc',
                                'monocito_perc', 'limfocito_perc', 'palochko_perc'],
                'ПЦР': ['date', 'detected'],
                'Биохимия Covid19': ['CRE', 'ALT', 'AST', 'LDG', 'UREA', 'fosph_act',
                                     'KFK', 'Albumin', 'TBil', 'SRB', 'K', 'Na', 'glykoza']
                }


TABLE_DICT = {'Коагулограмма':
                {
                'дата': {'name': 'Дата', 'type': 'date', 'unit': ''},
                'аптв': {'name': 'АПТВ', 'type': float, 'unit': '(сек.)'},
                'мно': {'name': 'МНО', 'type': float, 'unit': ''},
                'пв': {'name': 'ПВ', 'type': float, 'unit': '(сек.)'},
                'пти': {'name': 'ПТИ', 'type': float, 'unit': '(%)'},
                'фибриноген': {'name': 'Фибриноген', 'type': float, 'unit': '(г/л)'}
                },
              'Общий анализ крови развернутый':
                {
                'дата': {'name': 'Дата', 'type': 'date', 'unit': ''},
                'эритроциты': {'name': 'Эритроциты', 'type': float, 'unit': '(10^12)'},
                'тромбоциты': {'name': 'Тромбоциты', 'type': float, 'unit': '(10^9)'},
                'нейтрофилы': {'name': 'Нейтрофилы', 'type': float, 'unit': '(%)'},
                'моноциты': {'name': 'Моноциты', 'type': float, 'unit': '(%)'},
                'лимфоциты': {'name': 'Лимфоциты', 'type': float, 'unit': '(%)'},
                'лейкоциты': {'name': 'Лейкоциты', 'type': float, 'unit': '(10^9)'},
                'гемоглобин': {'name': 'Гемоглобин', 'type': float, 'unit': '(г/л)'},
                'гематокрит': {'name': 'Гематокрит', 'type': float, 'unit': '(%)'},
                'mcv': {'name': 'MCV', 'type': float, 'unit': '(фл)'},
                'mch': {'name': 'MCH', 'type': float, 'unit': '(пг)'},
                'mchc': {'name': 'MCHC', 'type': float, 'unit': '(г/л)'},
                'mpv': {'name': 'MPV', 'type': float, 'unit': '(фл)'},
                'эозинофилы': {'name': 'Эозинофилы', 'type': float, 'unit': '(%)'},
                'базофилы': {'name': 'Базофилы', 'type': float, 'unit': '(%)'},
                'rdw-sd': {'name': 'RDW-SD', 'type': float, 'unit': '(фл)'}
                }
              }
